

const a = parseInt(prompt('Введіть значення а')),
	b = parseInt(prompt('Введіть значення b')),
	c = parseInt(prompt('Введіть значення c'))
//Вираз 1
let S1 = (a + 12 + b)
//---------------------------------------------------------------------
//Вираз 2
let S2 = Math.sqrt((a + b) / (2 * a))
//------------------------------------------------------------------------
//Визаз 3
let S3 = Math.cbrt((a + b) * c)
//------------------------------------------------------------------
//Вираз 4
let S4 = Math.sin(a / -b)
//----------------------------------------------------------------
//Результат
//document.write('1) ',S1)
//document.write('2) ',S2)
//document.write('3) ',S3)
//document.write('4) ',S4)

document.write(`
      <ol>
           <li>${Math.round(S1)}</li>
           <li>${S2.toFixed(2)}</li>
           <li>${S3.toFixed(2)}</li>
           <li>${S4.toFixed(2)}</li>
      </ol>
`)
